package com.company;

public class HW7 {

    /*
    * 1. Напишите метод для нахождения наименьшего числа среди трех чисел.

Дано:

Первое число: 25

Второе число: 37

Третье число: 29

Ожидаемый результат:

Наименьшее значение: 25



2. Напишите метод для вычисления среднего значения трех чисел.

Дано:

Первое число: 25

Второе число: 45

Третье число: 65

Ожидаемый результат:

Среднее значение 45,0



3. Напишите метод подсчета всех гласных букв в строке.

Дано:

DarTech123

Ожидаемый результат:

Количество гласных в строке: 2



4. Напишите метод для подсчета всех слов в строке.

Дано:

Введите строку: Java is good to learn Object Oriented programming.

Ожидаемый результат:

Количество слов в строке: 8



5. Дано целое неотрицательное число. Напишите метод для подсчета количества цифр числа, имеющих значение 2.

Дано:

1254212

Ожидаемый результат:

3



5. Напишите метод, который проверяет, все ли символы в заданной строке являются гласными (a, e, i, o, u) или нет. Верните true, если каждый символ строки является гласным, иначе верните false.

Дано:

AIEEE

Ожидаемый результат:

true



6. Напишите метод для определения площади пятиугольника.

Дано:

Количество сторон: 5

Длина стороны: 6

Ожидаемый результат:

Площадь пятиугольника равна 61,937



7. Напишите метод для вычисления суммы цифр целого числа.

Дано:

252

Ожидаемый результат:

Сумма = 9*/
}
